export default function Introduction(){
    return(
        <article className="mt-5">
            <h2 id="intro" className="title-h2">  مقدمة حول البايثون . </h2>
            <h3 className="title-h3">1 - ما هو البايثون .</h3> 
            <p className="style_divv">
                البايثون هي لغة برمجة عالية المستوى وغير متخصصة معروفة بقراءتها وبساطتها. تم إنشاؤها بواسطة جويدو فان روسوم وتم إصدارها لأول مرة في عام 1991. صممت البايثون لتكون سهلة التعلم والاستخدام، مع بنية نظيفة وبسيطة تؤكد على قراءة الشيفرة. تدعم البايثون عدة نماذج لبرمجة، بما في ذلك البرمجة الإجرائية، والبرمجة الكائنية التوجيهية، والبرمجة الوظيفية.
            </p>
            <h3 className="title-h3">2 - ماذا يمكن أن تفعل البايثون .</h3> 
            <p className="style_divv">
                البايثون هي لغة متعددة الاستخدامات مع مجموعة واسعة من التطبيقات. فيما يلي بعض الأشياء التي يمكن أن تقوم بها البايثون:
                <ul>
                    <li><b className="text-success">تطوير الويب :</b> يمكن استخدام البايثون لتطوير الخوادم في تطبيقات الويب باستخدام إطارات مثل Django و Flask.</li>
                    <li><b className="text-success">علوم البيانات والتحليل :</b> تستخدم البايثون على نطاق واسع لتلاعب وتحليل البيانات، مع مكتبات مثل NumPy و Pandas و Matplotlib.</li>
                    <li><b className="text-success">تعلم الآلة والذكاء الاصطناعي :</b> أصبحت البايثون خيارًا شائعًا لتطوير التعلم الآلي والذكاء الاصطناعي، مع مكتبات مثل TensorFlow و PyTorch.</li>
                    <li><b className="text-success">تطوير الألعاب :</b> يمكن استخدام البايثون لتطوير الألعاب، وهناك مكتبات وأطُر مثل Pygame لهذا الغرض.</li>
                    <li><b className="text-success">تطبيقات سطح المكتب :</b> يمكن استخدام البايثون لتطوير تطبيقات سطح المكتب باستخدام إطارات مثل Tkinter.</li>
                    <li><b className="text-success">برمجة الشبكات :</b> يستخدم البايثون في برمجة الشبكات والنصوص الآلية، مما يجعله مفيدًا للمهام المتعلقة بالشبكات وأمان المعلومات.</li>
                </ul>
            </p>
            <h3 className="title-h3">3 - لماذا البايثون .</h3> 
            <p className="style_divv">
                هناك العديد من الأسباب التي تجعل البايثون خيارًا شائعًا بين المطورين:
                <ul>
                    <li><b className="text-success">القراءة :</b> يجعل البنية النظيفة والسهلة للقراءة في البايثون من الشيفرة سهلة الفهم والكتابة، مما يقلل من تكلفة صيانة البرنامج وتطويره.</li>
                    <li><b className="text-success">التنوع :</b> يمكن استخدام البايثون في مجموعة واسعة من التطبيقات، من تطوير الويب إلى الحوسبة العلمية وتعلم الآلة وغيرها.</li>
                    <li><b className="text-success">المجتمع والبيئة البيئية :</b> يحتوي البايثون على مجتمع كبير ونشط من المطورين، مما يسهم في بيئة واسعة من المكتبات والأطُر التي تبسط مهام التطوير.</li>
                    <li><b className="text-success">سهولة التعلم :</b> يعرف البايثون ببساطته وسهولته للقراءة، مما يجعله خيارًا ممتازًا للمبتدئين، حيث يتميز بتعلم سلس، مما يتيح للمبتدئين فهم المفاهيم البرمجية بسرعة.</li>
                    <li><b className="text-success">مصدر مفتوح :</b> البايثون هو لغة مفتوحة المصدر، مما يعني أن شيفرتها متاحة بحرية. وهذا يشجع على التعاون والابتكار والتحسين المستمر.</li>
                </ul> 
            </p>
        </article>
    )
}